#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```
terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.repository["atc-core"].github_repository_file.files[".github/workflows/nightly.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/nightly.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Test
                    run: make rust-test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
        id                  = "atc-core/.github/workflows/nightly.yml"
        # (7 unchanged attributes hidden)
    }

  # module.repository["benchmarks"].github_repository_file.files[".github/workflows/nightly.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/nightly.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Test
                    run: make rust-test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
        id                  = "benchmarks/.github/workflows/nightly.yml"
        # (7 unchanged attributes hidden)
    }

  # module.repository["tool-simulation"].github_repository_file.files[".github/workflows/nightly.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/nightly.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Test
                    run: make rust-test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
        id                  = "tool-simulation/.github/workflows/nightly.yml"
        # (7 unchanged attributes hidden)
    }

  # module.repository_emb_template["stm32"].github_branch.branch["develop"] will be created
  + resource "github_branch" "branch" {
      + branch        = "develop"
      + etag          = (known after apply)
      + id            = (known after apply)
      + ref           = (known after apply)
      + repository    = "embedded-template-stm32"
      + sha           = (known after apply)
      + source_branch = "main"
      + source_sha    = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_branch_default.default will be created
  + resource "github_branch_default" "default" {
      + branch     = "develop"
      + id         = (known after apply)
      + repository = "embedded-template-stm32"
    }

  # module.repository_emb_template["stm32"].github_branch_protection.all["*"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "*"
      + repository_id                   = "embedded-template-stm32"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_emb_template["stm32"].github_branch_protection.all["**/**"] will be created
  + resource "github_branch_protection" "all" {
      + allows_deletions                = true
      + allows_force_pushes             = true
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + pattern                         = "**/**"
      + repository_id                   = "embedded-template-stm32"
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # module.repository_emb_template["stm32"].github_branch_protection.protection["develop"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "develop"
      + repository_id                   = "embedded-template-stm32"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_emb_template["stm32"].github_branch_protection.protection["main"] will be created
  + resource "github_branch_protection" "protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + pattern                         = "main"
      + repository_id                   = "embedded-template-stm32"
      + require_conversation_resolution = true
      + require_signed_commits          = true
      + required_linear_history         = false

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = true
          + pull_request_bypassers          = [
              + "A_kwHOBayTi84AAq0w",
            ]
          + require_code_owner_reviews      = true
          + required_approving_review_count = 1
          + restrict_dismissals             = true
        }

      + required_status_checks {
          + strict = true
        }
    }

  # module.repository_emb_template["stm32"].github_repository.repository will be created
  + resource "github_repository" "repository" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = false
      + allow_squash_merge          = false
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Arrow Embedded Template - STM32 Projects"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + has_wiki                    = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = true
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "embedded-template-stm32"
      + node_id                     = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + visibility                  = "public"
      + vulnerability_alerts        = true
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".commitlintrc.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            ## DO NOT EDIT!
            ## This file was provisioned by Terraform
            ## File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.commitlintrc.yml
            
            rules:
              body-leading-blank: [1, always]
              body-max-line-length: [2, always, 100]
              footer-leading-blank: [1, always]
              footer-max-line-length: [2, always, 100]
              header-max-length: [2, always, 100]
              subject-case:
                - 2
                - never
                - [sentence-case, start-case, pascal-case, upper-case]
              subject-empty: [2, never]
              subject-full-stop: [2, never, "."]
              type-case: [2, always, lower-case]
              type-empty: [2, never]
              type-enum:
                - 2
                - always
                - [build, chore, ci, docs, feat, fix, perf, refactor, revert, style, test]
        EOT
      + file                = ".commitlintrc.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".cspell.config.yaml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ---
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.cspell.config.yaml
            
            $schema: https://raw.githubusercontent.com/streetsidesoftware/cspell/main/cspell.schema.json
            version: '0.2'
            language: "en"
            dictionaryDefinitions:
              - name: project-words
                path: './.cspell.project-words.txt'
                addWords: true
            dictionaries: ["project-words"]
            ignoreRegExp:
              - '\..*'
            ignorePaths:
              - 'node_modules'
              - 'build'
              - '*.css'
              - '*.svg'
              - '*/**Makefile'
              - 'target'
              - 'out'
              - 'coverage'
        EOT
      + file                = ".cspell.config.yaml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".editorconfig"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            # EditorConfig helps developers define and maintain consistent
            # coding styles between different editors and IDEs
            # editorconfig.org
            root = true
            [*]
            end_of_line = lf
            charset = utf-8
            trim_trailing_whitespace = true
            insert_final_newline = true
            indent_style = space
            indent_size = 4
            [{*.md,*.mdx,LICENSE*}]
            # double whitespace at end of line
            # denotes a line break in Markdown
            indent_size = off
            trim_trailing_whitespace = false
            [*.rs]
            trim_trailing_whitespace = false
            indent_style = space
            indent_size = 4
            [{Makefile*,*.mk,*.sh}]
            indent_style = tab
            indent_size = 4
            [{*.tsx,*.html,*.yml,*.yaml,*.toml,*.json,*.tf,*.hcl}]
            indent_size = 2
            # we might want to use https://www.npmjs.com/package/lintspaces instead, we can't lint the css and js comments atm
            [{*.js,*.css,Cargo.lock}]
            indent_size = unset
        EOT
      + file                = ".editorconfig"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".env.base"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/stm32-all/.env.base.tftpl
            
            PROJECT_NAME=embedded-template-stm32
            DOCKER_NAME=arrow-embedded-template-stm32
        EOT
      + file                = ".env.base"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".github/CODEOWNERS"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            * @Arrow-air/services
        EOT
      + file                = ".github/CODEOWNERS"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".github/workflows/autoupdate.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/stm32-all/.github/workflows/autoupdate.yml
            
            name: Auto-update
            
            on:
              push:
                branches:
                  - 'develop'
            
            jobs:
              Auto:
                name: Auto-update
                runs-on: ubuntu-latest
                steps:
                  - uses: tibdex/auto-update@v2
        EOT
      + file                = ".github/workflows/autoupdate.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".github/workflows/nightly.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/stm32-all/.github/workflows/nightly.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make build
                  - name: Test
                    run: make test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
      + file                = ".github/workflows/nightly.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".github/workflows/release.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/stm32-all/.github/workflows/release.yml
            
            name: Tag and Release
            
            on:
              pull_request:
                types:
                  - closed
                branches:
                  - 'main'
                  - 'develop'
              workflow_dispatch:
            
            env:
              TERM: xterm
            
            jobs:
              prepare:
                if: github.event.pull_request.merged == true || github.event_name == 'workflow_dispatch'
                name: Create Tag and Release notes
                permissions:
                  contents: write
                  packages: write
                  deployments: write
                  pull-requests: write
                runs-on: ubuntu-latest
                concurrency:
                  group: release-${{ github.head_ref || 'main' }}
                steps:
                  - name: Import Arrow bot's GPG key for signing commits
                    id: import-gpg
                    uses: crazy-max/ghaction-import-gpg@v4
                    with:
                      gpg_private_key: ${{ secrets.COMMITBOT_GPG_PRIVATE_KEY }}
                      passphrase: ${{ secrets.COMMITBOT_GPG_PASSPHRASE }}
                      git_config_global: true
                      git_user_signingkey: true
                      git_commit_gpgsign: true
                      git_tag_gpgsign: true
            
                  - name: Checkout Code
                    uses: actions/checkout@v3
                    with:
                      token: ${{ secrets.COMMITBOT_GITHUB_TOKEN }}
                      fetch-depth: 0
            
                  - name: Set up environment based on branch
                    run: |
                      if [ "$GITHUB_REF_NAME" != "main" ]
                      then
                        echo "CUSTOM_RELEASE_RULES=fix:prerelease,feat:prerelease,chore:prerelease" >> $GITHUB_ENV
                        echo "RELEASE_COMMIT_MESSAGE=fixup! ci: update release files\n\n[skip ci]" >> $GITHUB_ENV
                      else
                        echo "RELEASE_COMMIT_MESSAGE=ci: update release files\n\n[skip ci]" >> $GITHUB_ENV
                      fi
            
                  - name: Determine new Tag
                    uses: mathieudutour/github-tag-action@v6.1
                    id: tag_version
                    with:
                      github_token: ${{ secrets.GITHUB_TOKEN }}
                      pre_release_branches: develop
                      dry_run: true
                      custom_release_rules: "${{ env.CUSTOM_RELEASE_RULES }}"
            
                  - name: Automatic Rebase Autosquash
                    if: ${{ github.ref_name == 'develop' }}
                    run: |
                      git rebase -i --autosquash origin/main
                    env:
                      GIT_AUTHOR_NAME: ${{ steps.import-gpg.outputs.name }}
                      GIT_AUTHOR_EMAIL: ${{ steps.import-gpg.outputs.email }}
                      GIT_COMMITTER_NAME: ${{ steps.import-gpg.outputs.name }}
                      GIT_COMMITTER_EMAIL: ${{ steps.import-gpg.outputs.email }}
                      # git rebase with auto squash will be a noop if not run in interactive mode.
                      # using ':' or 'true' as the sequence editor allows us to automatically apply the squash actions
                      # https://git-scm.com/docs/git-config#Documentation/git-config.txt-sequenceeditor
                      GIT_SEQUENCE_EDITOR: ':'
            
                  - name: Generate Changelog
                    id: changelog
                    uses: mrchief/universal-changelog-action@v1.3.2
                    with:
                      previousReleaseTagNameOrSha: ${{ steps.tag_version.outputs.previous_tag }}
                      nextReleaseTagName: ${{ github.sha }}
                      nextReleaseName: "Release ${{ steps.tag_version.outputs.new_version }}"
            
                  - name: Update CHANGELOG.md
                    if: ${{ github.ref_name == 'main' }}
                    run: |
                      cat - CHANGELOG.md > temp <<'CHANGELOG.md-EOF'
                      ${{ steps.changelog.outputs.changelog }}
                      CHANGELOG.md-EOF
                      sed -i 's/releases\/tag\/${{ github.sha }}/releases\/tag\/${{ steps.tag_version.outputs.new_tag }}/g' temp
                      mv temp CHANGELOG.md
            
                  - name: Add release tag to .terraform_init
                    if: ${{ github.ref_name == 'main' }}
                    run: echo "${{ steps.tag_version.outputs.new_tag }}" >> .terraform_init
            
                  - name: Commit and push release updates
                    env:
                      CHANGED_FILES: ".terraform_init CHANGELOG.md"
                      GIT_AUTHOR_NAME: ${{ steps.import-gpg.outputs.name }}
                      GIT_AUTHOR_EMAIL: ${{ steps.import-gpg.outputs.email }}
                      GIT_COMMITTER_NAME: ${{ steps.import-gpg.outputs.name }}
                      GIT_COMMITTER_EMAIL: ${{ steps.import-gpg.outputs.email }}
                      # git rebase with auto squash will be a noop if not run in interactive mode.
                      # using ':' or 'true' as the sequence editor allows us to automatically apply the squash actions
                      # https://git-scm.com/docs/git-config#Documentation/git-config.txt-sequenceeditor
                      GIT_SEQUENCE_EDITOR: ':'
                    run: |
                      git commit $CHANGED_FILES -m "$(echo -e $RELEASE_COMMIT_MESSAGE)"
            
                  - name: Push any changes
                    run: |
                      git push -f
                      # set COMMIT_SHA env var with new current sha as it is used for tagging in the next step
                      echo "COMMIT_SHA=$(git rev-parse --verify HEAD)" >> $GITHUB_ENV
            
                  - name: Set and Push New Tag
                    uses: mathieudutour/github-tag-action@v6.1
                    with:
                      github_token: ${{ secrets.GITHUB_TOKEN }}
                      custom_tag: ${{ steps.tag_version.outputs.new_version }}
                      commit_sha: ${{ env.COMMIT_SHA }}
            
                  - name: Generate Changelog base on new tag
                    id: changelog_release
                    uses: mrchief/universal-changelog-action@v1.3.2
                    with:
                      previousReleaseTagNameOrSha: ${{ steps.tag_version.outputs.previous_tag }}
                      nextReleaseTagName: ${{ steps.tag_version.outputs.new_tag }}
                      nextReleaseName: "Release ${{ steps.tag_version.outputs.new_version }}"
            
                  - name: Create Release
                    id: create_release
                    uses: actions/create-release@v1
                    env:
                      GITHUB_TOKEN: ${{ secrets.COMMITBOT_GITHUB_TOKEN }}
                    with:
                      tag_name: ${{ steps.tag_version.outputs.new_tag }}
                      release_name: Release ${{ steps.tag_version.outputs.new_version }}
                      body: ${{ steps.changelog_release.outputs.changelog }}
                      draft: false
                      prerelease: ${{ github.ref_name == 'develop' }}
            
                  - name: Rebase develop branch
                    if: ${{ github.ref_name == 'main' }}
                    run: |
                      git checkout develop
                      git pull --rebase origin main
                      git push -f
                    env:
                      GIT_AUTHOR_NAME: ${{ steps.import-gpg.outputs.name }}
                      GIT_AUTHOR_EMAIL: ${{ steps.import-gpg.outputs.email }}
                      GIT_COMMITTER_NAME: ${{ steps.import-gpg.outputs.name }}
                      GIT_COMMITTER_EMAIL: ${{ steps.import-gpg.outputs.email }}
        EOT
      + file                = ".github/workflows/release.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".github/workflows/sanity_checks.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.github/workflows/sanity_checks.yml
            
            name: Sanity checks
            
            env:
              TERM: xterm
            
            on:
              push:
                branches:
                  - main
              pull_request:
            
            jobs:
              codestyle:
                name: Code Style Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make editorconfig-test
            
              cspell:
                name: Spelling Check
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make cspell-test
            
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                  - run: make md-test-links
        EOT
      + file                = ".github/workflows/sanity_checks.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".github/workflows/stm32_ci.yml"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/stm32-all/.github/workflows/stm32_ci.yml
            
            on:
              pull_request:
                branches:
                  - develop
                  - main
                paths:
                  - src/**
                  - .env.repo
            
            name: STM32 Checks
            
            env:
              TERM: xterm
            
            jobs:
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                if: ${{ !contains(github.event.head_commit.message, 'provisioned by terraform') }}
                steps:
                  - uses: actions/checkout@v2
                  - name: Build
                    run: make build
                  - name: Test
                    run: make test
            
              # fmt:
              #   name: Format Checker
              #   runs-on: ubuntu-latest
              #   steps:
              #     - uses: actions/checkout@v2
              #     - run: make rust-fmt
            
              # static:
              #   name: Static Analysis
              #   runs-on: ubuntu-latest
              #   steps:
              #     - uses: actions/checkout@v2
              #     - run: make static-analysis
            
              # coverage:
              #   name: Unit Test Coverage
              #   runs-on: ubuntu-latest
              #   env:
              #     NODE_COVERALLS_DEBUG: 1
              #   steps:
              #     - uses: actions/checkout@v2
              #     - run: |
              #         mkdir -p coverage
              #         make rust-coverage | tee coverage/ut.txt
              #         echo UT_COV=$(sed '/||/,$!d' coverage/ut.txt) >> $GITHUB_ENV
              #     - uses: coverallsapp/github-action@master
              #       with:
              #         github-token: ${{ secrets.github_token }}
              #         path-to-lcov: coverage/lcov.info
              #         base-path: .
              #     - uses: thollander/actions-comment-pull-request@v1
              #       continue-on-error: true
              #       with:
              #         message: |
              #           :beetle: Unit Testing Coverage :mag_right:
            
              #           ${{ env.UT_COV }}
            
              #           :point_right: [View in Coveralls.io](https://coveralls.io/github/${{ github.repository }}) :point_left:
              #         comment_includes: ':beetle: Unit Testing Coverage :mag_right:'
        EOT
      + file                = ".github/workflows/stm32_ci.yml"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".gitignore"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-svc/.env.base.tftpl
            
            CMakeCache.*
            CMakeFiles
            cmake_install.cmake
            *.swp
            build/
        EOT
      + file                = ".gitignore"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".make/base.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/base.mk
            
            SHELL := /bin/bash
            
            SANITYCHECKS_IMAGE_NAME := ghcr.io/arrow-air/tools/arrow-sanitychecks
            SANITYCHECKS_IMAGE_TAG  := 0.1
            
            SOURCE_PATH      ?= $(PWD)
            
            # Style templates for console output.
            GREEN  := $(shell echo -e `tput setaf 2`)
            YELLOW := $(shell echo -e `tput setaf 3`)
            CYAN   := $(shell echo -e `tput setaf 6`)
            BOLD   := $(shell echo -e `tput bold`)
            SMUL   := $(shell echo -e `tput smul`)
            SGR0   := $(shell echo -e `tput sgr0`)
            
            # function with a generic template to run docker with the required values
            # Accepts $1 = command to run, $2 = additional flags (optional)
            docker_run = docker run \
            	--name=$(DOCKER_NAME)-$@ \
            	--rm \
            	--user `id -u`:`id -g` \
            	--workdir=/usr/src/app \
            	-v "$(SOURCE_PATH)/:/usr/src/app" \
            	$(2) \
            	-t $(SANITYCHECKS_IMAGE_NAME):$(SANITYCHECKS_IMAGE_TAG) \
            	$(1)
            
            .SILENT: *docker-pull
            
            .help-base:
            	@echo ""
            	@echo "$(BOLD)$(CYAN)Available targets$(SGR0)"
            
            docker-pull:
            	@echo docker pull -q $(SANITYCHECKS_IMAGE_NAME):$(SANITYCHECKS_IMAGE_TAG)
        EOT
      + file                = ".make/base.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".make/commitlint.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/commitlint.mk
            
            COMMITLINT_CHECK :=
            
            .help-commitlint:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Commitlint$(SGR0)"
            	@echo "  $(BOLD)commitlint-test$(SGR0)  -- Run 'commitlint --edit $(COMMITLINT_CHECK)'"
            	@echo "                      to validate commit messages are following the conventional commit standards."
            
            commitlint-test: docker-pull
            	@echo "$(CYAN)Checking for commit message errors...$(SGR0)"
            	@$(call docker_run,commitlint --edit $(COMMITLINT_CHECK))
        EOT
      + file                = ".make/commitlint.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".make/cspell.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/cspell.mk
            CSPELL_PROJECT_WORDS ?= .cspell.project-words.txt
            
            .help-cspell:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)CSpell$(SGR0)"
            	@echo "  $(BOLD)cspell-test$(SGR0)      -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml'"
            	@echo "                      to validate files are not containing any spelling errors."
            	@echo "  $(BOLD)cspell-add-words$(SGR0) -- Run 'cspell --words-only --unique "**/**" -c .cspell.config.yaml | "
            	@echo "                      sort --ignore-case >> .cspell.project-words.txt'"
            	@echo "                      to add remaining words to the project's cspell ignore list"
            
            cspell-test: docker-pull
            ifeq ("$(wildcard $(CSPELL_PROJECT_WORDS))","")
            	@echo "$(YELLOW)No $(CSPELL_PROJECT_WORDS) found, creating...$(SGR0)"
            	touch $(CSPELL_PROJECT_WORDS)
            endif
            	@echo "$(CYAN)Checking for spelling errors...$(SGR0)"
            	@$(call docker_run,cspell --words-only --unique "**/**" -c .cspell.config.yaml)
            
            cspell-add-words: docker-pull
            	@echo "$(CYAN)Adding words to the project's cspell word list...$(SGR0)"
            	@$(call docker_run,sh -c 'cspell --words-only --unique "**/**" -c .cspell.config.yaml 2> /dev/null | sort -f >> .cspell.project-words.txt')
        EOT
      + file                = ".make/cspell.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".make/editorconfig.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/editorconfig.mk
            
            .help-editorconfig:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Editorconfig$(SGR0)"
            	@echo "  $(BOLD)editorconfig-test$(SGR0) -- Run editorconfig test to validate all file formats are valid"
            	@echo "  $(BOLD)editorconfig-tidy$(SGR0) -- Run editorconfig tidy to fix all file formats if needed"
            
            editorconfig-test:
            	@echo "$(CYAN)Checking if the codebase is compliant with the .editorconfig file...$(SGR0)"
            	@docker run \
            		--name=$(DOCKER_NAME)-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t mstruebing/editorconfig-checker
            
            editorconfig-tidy: docker-pull
            	@echo "$(CYAN)Running editorconfig formatting fixes...$(SGR0)"
            	@$(call docker_run,sh -c 'eclint fix .')
        EOT
      + file                = ".make/editorconfig.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".make/env.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/env.mk
            
            ENV_FILE := $(wildcard .env .env.base)
            # If .env is missing, install .env.base+.env.repo as .env and load that.
            ifeq ($(ENV_FILE),.env.base)
            $(warning Settings file '.env' missing: '$(ENV_FILE)' => installing .env as merge of .env.base + .env.repo!)
            $(shell cat .env.base .env.repo > .env 2>/dev/null)
            endif
            
            # Sanity check, make sure keys from base and repo are present.
            # Strip empty lines and comments, get sorted keys (e.g. DOCKER_NAME)
            ENV_KEYS=$(shell grep -Ehv '^\s*(\#.*)?\s*$$' .env.base .env.repo 2>/dev/null | cut -f1 -d= | sort)
            # Check if key exists in .env, if not grep it from the .env.base/repo into your .env
            $(foreach k, $(ENV_KEYS), $(eval $(shell sh -c "grep -q '^$(k)=' .env 2>/dev/null || (echo '*** NOTE: Adding missing .env key [$(k)] to your .env file!' 1>&2 ; grep -h '^$(k)=' .env.base .env.repo 2>/dev/null >> .env ; grep '^$(k)=' .env 1>&2)")))
            
            -include $(ENV_FILE)
        EOT
      + file                = ".make/env.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".make/markdown.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/all/.make/markdown.mk
            
            MARKDOWN_FILES ?= $(shell find . -type f -iname '*md' ! -iwholename "*./node_modules/*" ! -path "./build" ! -iwholename "*.terraform*" ! -iwholename "*.cargo/*")
            LINK_CHECKER_JSON ?= .link-checker.config.json
            
            .help-markdown:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Markdown$(SGR0)"
            	@echo "  $(BOLD)md-test-links$(SGR0)   -- Run markdown-link-check on all markdown files to catch dead links."
            
            md-test-links:
            ifeq ("$(MARKDOWN_FILES)", "")
            	@echo "$(YELLOW)No markdown files found, skipping link validation...$(SGR0)"
            else
            ifeq ("$(wildcard $(LINK_CHECKER_JSON))","")
            	@echo "$(YELLOW)No $(LINK_CHECKER_JSON) found, creating...$(SGR0)"
            	echo -e "{\n}\n" > $(LINK_CHECKER_JSON)
            endif
            	@echo "$(CYAN)Checking if all document links are valid...$(SGR0)"
            	@docker run \
            		--name=$(DOCKER_NAME)-$@ \
            		--rm \
            		--user `id -u`:`id -g` \
            		-w "/usr/src/app" \
            		-v "$(PWD):/usr/src/app" \
            		-t ghcr.io/tcort/markdown-link-check:stable \
            		-c $(LINK_CHECKER_JSON) $(MARKDOWN_FILES)
            endif
        EOT
      + file                = ".make/markdown.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files[".make/st.mk"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/stm32-all/.make/st.mk
            #
            BUILD_IMAGE_NAME     ?= ghcr.io/arrow-air/tools/arrow-stm32
            BUILD_IMAGE_TAG      ?= 1.0
            OUTPUTS_PATH        ?= $(SOURCE_PATH)/out
            ADDITIONAL_OPT      ?=
            
            build_run = docker run \
            	--name=$(BUILD_IMAGE_NAME)-$@ \
            	--rm \
            	--user `id -u`:`id -g` \
            	--workdir=/usr/src/app/ \
            	--env-file=$(SOURCE_PATH)/.env \
            	$(ADDITIONAL_OPT) \
            	-v "$(SOURCE_PATH)/:/usr/src/app/" \
            	-t $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG) \
            	/bin/bash -c "$(1)"
            
            build-docker-pull:
            	@echo docker pull -q $(BUILD_IMAGE_NAME):$(BUILD_IMAGE_TAG)
            
            .help-st:
            	@echo ""
            	@echo "$(SMUL)$(BOLD)$(GREEN)Build Container$(SGR0)"
            	@echo "  $(BOLD)build$(SGR0)       -- Run 'cmake'"
            
            .SILENT: build-docker-pull
            
            stm32-build: build-docker-pull
            	@echo "$(CYAN)Running cmake...$(SGR0)"
            	mkdir -p build
            	@$(call build_run,cmake -B build/)
            	@$(call build_run,cd build && make $(PROJECT_NAME))
            
            stm32-flash: build-docker-pull build
            	@echo "$(YELLOW)Flashing tool not implemented. Skipping.$(SGR0)"
            
            stm32-test:build-docker-pull
            	@echo "$(YELLOW)Testing framework not implemented. Skipping.$(SGR0)"
            
            stm32-clean: build-docker-pull
            	@echo "$(CYAN)Cleaning project...$(SGR0)"
            	@$(call build_run,cd build && make clean)
        EOT
      + file                = ".make/st.mk"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files["CONTRIBUTING.md"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            See [Contributing Guide](https://www.arrowair.com/docs/contributing/intro)  on Arrow website.
        EOT
      + file                = "CONTRIBUTING.md"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.files["Makefile"] will be created
  + resource "github_repository_file" "files" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            fixup! ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
            # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/stm32-all/Makefile
            
            include .make/env.mk
            export
            
            help: .help-base .help-cspell .help-markdown .help-editorconfig .help-commitlint
            build: stm32-build
            clean: stm32-clean
            test: stm32-test cspell-test md-test-links editorconfig-test
            tidy: editorconfig-tidy
            
            include .make/st.mk
            include .make/base.mk
            include .make/cspell.mk
            include .make/markdown.mk
            include .make/editorconfig.mk
            include .make/commitlint.mk
        EOT
      + file                = "Makefile"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_file.init will be created
  + resource "github_repository_file" "init" {
      + branch              = "develop"
      + commit_message      = <<-EOT
            ci: terraform provisioned file changes
            
            [skip ci]
        EOT
      + commit_sha          = (known after apply)
      + content             = <<-EOT
            DO NOT REMOVE
            This repository is managed by Terraform and contains files that will be overwritten when changed
            This file is part of the management of repository embedded-template-stm32
        EOT
      + file                = ".terraform_init"
      + id                  = (known after apply)
      + overwrite_on_create = true
      + repository          = "embedded-template-stm32"
      + sha                 = (known after apply)
    }

  # module.repository_emb_template["stm32"].github_repository_webhook.map["discord"] will be created
  + resource "github_repository_webhook" "map" {
      + active     = true
      + etag       = (known after apply)
      + events     = [
          + "pull_request",
          + "pull_request_review",
          + "pull_request_review_comment",
          + "pull_request_review_thread",
        ]
      + id         = (known after apply)
      + repository = "embedded-template-stm32"
      + url        = (known after apply)

      + configuration {
          + content_type = "json"
          + insecure_ssl = false
          + url          = (sensitive value)
        }
    }

  # module.repository_emb_template["stm32"].github_team_repository.maintainer["services"] will be created
  + resource "github_team_repository" "maintainer" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "embedded-template-stm32"
      + team_id    = "services"
    }

  # module.repository_lib_template["rust"].github_repository_file.files[".github/workflows/nightly.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/nightly.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Test
                    run: make rust-test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
        id                  = "lib-template-rust/.github/workflows/nightly.yml"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_lib["ccsds"].github_repository_file.files[".github/workflows/nightly.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/nightly.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Test
                    run: make rust-test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
        id                  = "lib-ccsds/.github/workflows/nightly.yml"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_lib["common"].github_repository_file.files[".github/workflows/nightly.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/nightly.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Test
                    run: make rust-test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
        id                  = "lib-common/.github/workflows/nightly.yml"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_lib["itest"].github_repository_file.files[".github/workflows/nightly.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/nightly.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Test
                    run: make rust-test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
        id                  = "lib-itest/.github/workflows/nightly.yml"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_lib["router"].github_repository_file.files[".github/workflows/nightly.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/nightly.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Test
                    run: make rust-test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
        id                  = "lib-router/.github/workflows/nightly.yml"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_svc["assets"].github_repository_file.files[".github/workflows/nightly.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/nightly.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Test
                    run: make rust-test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
        id                  = "svc-assets/.github/workflows/nightly.yml"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_svc["cargo"].github_repository_file.files[".github/workflows/nightly.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/nightly.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Test
                    run: make rust-test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
        id                  = "svc-cargo/.github/workflows/nightly.yml"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_svc["compliance"].github_repository_file.files[".github/workflows/nightly.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/nightly.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Test
                    run: make rust-test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
        id                  = "svc-compliance/.github/workflows/nightly.yml"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_svc["devops-test"].github_repository_file.files[".github/workflows/nightly.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/nightly.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Test
                    run: make rust-test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
        id                  = "svc-devops-test/.github/workflows/nightly.yml"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_svc["pricing"].github_repository_file.files[".github/workflows/nightly.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/nightly.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Test
                    run: make rust-test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
        id                  = "svc-pricing/.github/workflows/nightly.yml"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_svc["scheduler"].github_repository_file.files[".github/workflows/nightly.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/nightly.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Test
                    run: make rust-test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
        id                  = "svc-scheduler/.github/workflows/nightly.yml"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_svc["storage"].github_repository_file.files[".github/workflows/nightly.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/nightly.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Test
                    run: make rust-test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
        id                  = "svc-storage/.github/workflows/nightly.yml"
        # (7 unchanged attributes hidden)
    }

  # module.repository_rust_svc["telemetry"].github_repository_file.files[".github/workflows/nightly.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/nightly.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Test
                    run: make rust-test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
        id                  = "svc-telemetry/.github/workflows/nightly.yml"
        # (7 unchanged attributes hidden)
    }

  # module.repository_svc_template["rust"].github_repository_file.files[".github/workflows/nightly.yml"] will be updated in-place
  ~ resource "github_repository_file" "files" {
      ~ content             = <<-EOT
            ## DO NOT EDIT!
            # This file was provisioned by Terraform
          - # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/rust_ci.yml
          + # File origin: https://github.com/Arrow-air/tf-github/tree/main/src/templates/rust-all/.github/workflows/nightly.yml
            #
            on:
              schedule:
                - cron: '0 4 * * *' # run at 4 AM UTC
            
            name: Nightly Build
            
            env:
              TERM: xterm
            
            jobs:
              # Will catch broken dependencies
              build_and_test_debug:
                name: Build & Test
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - name: Build
                    run: make rust-build
                  - name: Test
                    run: make rust-test
            
              # Check if any URLs no longer work
              md-test:
                name: Markdown Broken Link Checker
                runs-on: ubuntu-latest
                steps:
                  - uses: actions/checkout@v2
                    with:
                      ref: develop
                  - run: make md-test-links
        EOT
        id                  = "svc-template-rust/.github/workflows/nightly.yml"
        # (7 unchanged attributes hidden)
    }

Plan: 30 to add, 17 to change, 0 to destroy.

```

</details>

*Pusher: @ServiceDog, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*